In [2]:
!pip install sqlalchemy==2.0.27 --user

Collecting sqlalchemy==2.0.27
  Using cached SQLAlchemy-2.0.27-cp39-cp39-win_amd64.whl (2.1 MB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\rihar\appdata\roaming\python\python39\site-packages (from sqlalchemy==2.0.27) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\rihar\appdata\roaming\python\python39\site-packages (from sqlalchemy==2.0.27) (3.0.3)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed sqlalchemy-2.0.27

In [2]:
%load_ext sql

In [3]:
import csv,sqlite3
conn = sqlite3.connect('my_data1.db')
cur = conn.cursor()

In [4]:
%sql sqlite:///my_data1.db

In [5]:
import pandas as pd
df = pd.read_csv("C:/Users/rihar/OneDrive/Dators/macibu materials/coursera/pitonis/DataScience Capstone/Spacex.csv")
df.to_sql("SPACEXTBL", conn, if_exists='replace', index=False,method="multi")

C:\Tools\anaconda3\lib\site-packages\pandas\core\generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [6]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%sql select * from SPACEXTABLE limit 3

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt')]

# TASKS

### Task 1

In [8]:
%sql select distinct Launch_Site from spacextable

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### Task 2

In [9]:
%sql select Launch_Site from spacextable where Launch_Site like 'CCA%' limit 5

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]

### Taskn 3

In [19]:
%sql select Customer, sum(PAYLOAD_MASS__KG_) from spacextable where Customer == 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[('NASA (CRS)', 45596)]

### Task 4

In [11]:
%sql select Booster_Version, avg(PAYLOAD_MASS__KG_) from spacextable where Booster_Version = 'F9 v1.1'

 * sqlite:///my_data1.db
Done.

[('F9 v1.1', 2928.4)]

### Task 5

In [12]:
%sql select min(Date) from spacextable where Mission_Outcome is 'Success'

 * sqlite:///my_data1.db
Done.

[('2010-06-04',)]

### Task 6

In [13]:
%%sql 
select distinct Booster_Version, Launch_Site, Landing_Outcome
from spacextable 
where Landing_Outcome is 'Success (drone ship)' and PAYLOAD_MASS__KG_ between 4000 and 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 'CCAFS LC-40', 'Success (drone ship)'),
 ('F9 FT B1026', 'CCAFS LC-40', 'Success (drone ship)'),
 ('F9 FT  B1021.2', 'KSC LC-39A', 'Success (drone ship)'),
 ('F9 FT  B1031.2', 'KSC LC-39A', 'Success (drone ship)')]

### Task 7

In [14]:
%sql select  Mission_outcome, count(Mission_Outcome),Landing_Outcome from spacextable group by Mission_Outcome

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1, 'Precluded (drone ship)'),
 ('Success', 98, 'Failure (parachute)'),
 ('Success ', 1, 'No attempt'),
 ('Success (payload status unclear)', 1, 'Success (ground pad)')]

### Task 8

In [15]:
%sql select booster_version from spacextable where PAYLOAD_MASS__KG_ == (select max(PAYLOAD_MASS__KG_) from spacextable)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9

In [16]:
%%sql
select 
    substr(Date,0,5) as Year,
    substr(Date,6,2) as Month,
    landing_outcome,
    booster_version,
    launch_site 
from
    spacextable
where
    landing_outcome is 'Failure (drone ship)' and
    Year == '2015'

 * sqlite:///my_data1.db
Done.

[('2015', '01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('2015', '04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10

In [17]:
%%sql
select
    landing_outcome,
    count(landing_outcome) as count
from
    spacextable
where
    date between '2010-06-04' and '2017-03-20'
group by
    landing_outcome
order by
    count desc

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]

In [18]:
%sql select distinct landing_outcome from spacextable

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',)]